Config/Catalogs/НастройкиОбменаБанкиКС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>НастройкиОбменаБанкиКС</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ТипыОбменаБанкиКС</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СпособОбмена</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыВыгрузкиФайловПередачи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьВыгрузкиПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьЗагрузкиПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сервер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьНаСервере</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗащищенноеСоединение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПассивноеСоединение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Таймаут</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагружатьОтветСервисаВнешнейОбработкой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьBOM</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтролироватьБезопасностьОбменаЧерезКаталог</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбменНаКлиенте</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Параметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Описание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>1024</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Enums/СпособыВыгрузкиФайловПередачи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СпособыВыгрузкиФайловПередачи</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Каталог</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>FTP</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>WebСервис</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Catalogs/НастройкиОбменаБанкиКС/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Перем ПортПротокола;

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Проверить выполнение отложенных обработчиков
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	// ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец ВерсионированиеОбъектов
	
	// Обработчик подсистемы запрета редактирования реквизитов объектов
	ЗапретРедактированияРеквизитовОбъектов.ЗаблокироватьРеквизиты(ЭтаФорма);	
	
	//если это обмен с еис, заполним настройки по умолчанию:
	//адрес обмена https://int44.zakupki.gov.ru/eis-integration/services-vbs/financial-docs?wsdl - старый адрес
	//адрес обмена https://int.zakupki.gov.ru/eis-integration/services-vbs/financial-docs?wsdl - новый
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка)
		И НЕ ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		Если ЗначениеЗаполнено(Объект.Владелец)
			И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Владелец,"ПредставлениеВНомереВерсии") = "UISP" Тогда
			
			Объект.СпособОбмена = Перечисления.СпособыВыгрузкиФайловПередачи.WebСервис;
			Объект.ПутьВыгрузкиПоУмолчанию = "https://int.zakupki.gov.ru/eis-integration/services-vbs/financial-docs?wsdl";
			Объект.Таймаут = 80;
			Объект.ОбменНаКлиенте = Истина;
			
		КонецЕсли;
	КонецЕсли;	
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбработатьВидОбмена();
	ОбработатьСпособОбмена(Истина);	
	
	Элементы.ГруппаПарольКнопки.Доступность = Ложь;
	Элементы.ГруппаПарольКнопки.Ширина = 3;
	УправлениеМаскированиемПароля(Истина);   
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры    

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	УстановитьПривилегированныйРежим(Истина);
	ПарольПрочитанный = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(Объект.Ссылка);
	УстановитьПривилегированныйРежим(Ложь);		
	Пароль = ?(ЗначениеЗаполнено(ПарольПрочитанный), ЭтотОбъект.УникальныйИдентификатор, "");     
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	Если ПарольИзменен Тогда
		УстановитьПривилегированныйРежим(Истина);
		ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(ТекущийОбъект.Ссылка, Пароль);
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// Обработчик подсистемы запрета редактирования реквизитов объектов
	ЗапретРедактированияРеквизитовОбъектов.ЗаблокироватьРеквизиты(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВладелецПриИзменении(Элемент)
	
	ОбработатьВидОбмена();
	
КонецПроцедуры

&НаКлиенте
Процедура СпособОбменаПриИзменении(Элемент)
	
	ОбработатьСпособОбмена();
	
КонецПроцедуры

&НаКлиенте
Процедура ПутьВыгрузкиПоУмолчаниюПриИзменении(Элемент)
	
	ОпределитьСпособОбменаПоАдресу();
	
КонецПроцедуры

&НаКлиенте
Процедура ПутьВыгрузкиПоУмолчаниюНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьФормуВыбораКаталога(Элемент.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ПутьЗагрузкиПоУмолчаниюНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьФормуВыбораКаталога(Элемент.Имя);
	
КонецПроцедуры


&НаКлиенте
Процедура АдресПриИзменении(Элемент)
	
	ОпределитьСпособОбменаПоАдресу();
	УстановитьПараметрыАдреса();
	
КонецПроцедуры

&НаКлиенте
Процедура ПарольПриИзменении(Элемент)

	ПарольИзменен = Истина;
	Элементы.ГруппаПарольКнопки.Доступность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗащищенноеСоединениеПриИзменении(Элемент)
	
	ПриИзмененииПорта();

КонецПроцедуры

&НаКлиенте
Процедура ПортПриИзменении(Элемент)

	ПриИзмененииПорта();

КонецПроцедуры


#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПараметры

&НаКлиенте
Процедура ПараметрыЗначениеНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	
	Элементы.ПараметрыЗначение.СписокВыбора.Очистить();
	
	ТекДанные = Элементы.Параметры.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПроверяемоеИмяПараметра = ВРег(ТекДанные.Имя);
	
	Если ПроверяемоеИмяПараметра = ВРег("ИмяОбщегоМодуляОбработки") Тогда
		Элементы.ПараметрыЗначение.СписокВыбора.Добавить("Госуслуги");
	ИначеЕсли ПроверяемоеИмяПараметра = ВРег("ТипСообщения") Тогда
		Элементы.ПараметрыЗначение.СписокВыбора.Добавить("GSRV");
		Элементы.ПараметрыЗначение.СписокВыбора.Добавить("GFNC");
		//Элементы.ПараметрыЗначение.СписокВыбора.Добавить("OTHR");
	ИначеЕсли ПроверяемоеИмяПараметра = ВРег("КатегорияВзаимодействия") Тогда
		Элементы.ПараметрыЗначение.СписокВыбора.Добавить("0");
		Элементы.ПараметрыЗначение.СписокВыбора.Добавить("1");
		Элементы.ПараметрыЗначение.СписокВыбора.Добавить("2");
		Элементы.ПараметрыЗначение.СписокВыбора.Добавить("3");
		Элементы.ПараметрыЗначение.СписокВыбора.Добавить("4");
		Элементы.ПараметрыЗначение.СписокВыбора.Добавить("5");
		Элементы.ПараметрыЗначение.СписокВыбора.Добавить("6");
	ИначеЕсли ПроверяемоеИмяПараметра = ВРег("ПрефиксКодаГосУслуги") Тогда
		Элементы.ПараметрыЗначение.СписокВыбора.Добавить("AAAAA");
		
	ИначеЕсли ПроверяемоеИмяПараметра = ВРег("ЗагружатьНовыеИзмененныеПлатежи") Тогда
		Элементы.ПараметрыЗначение.СписокВыбора.Добавить(Истина);
		Элементы.ПараметрыЗначение.СписокВыбора.Добавить(Ложь);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыИмяПриИзменении(Элемент)
	ТекДанные = Элементы.Параметры.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ПроверяемоеИмяПараметра = ВРег(ТекДанные.Имя);
	
	Если ПроверяемоеИмяПараметра = ВРег("ПрефиксКодаГосУслуги") Тогда
		ОписаниеТипа = Новый ОписаниеТипов("Строка");
		ТекДанные.Значение = ОписаниеТипа.ПривестиЗначение(ТекДанные.Значение);
		Если НЕ ЗначениеЗаполнено(ТекДанные.Значение) Тогда
			ТекДанные.Значение = "AAAAA";
		КонецЕсли;
		
	ИначеЕсли ПроверяемоеИмяПараметра = ВРег("ОФК") Тогда
		ОписаниеТипа = Новый ОписаниеТипов("СправочникСсылка.Казначейства");
		ТекДанные.Значение = ОписаниеТипа.ПривестиЗначение(ТекДанные.Значение);
		ТекДанные.Описание = "Подключение автоматической подстановки предопределенных данных о казначействе в заголовочную часть экспортируемых файлов (почтовая секция файла, именованная в формате маркером ""TO"")";	
		
    ИначеЕсли ПроверяемоеИмяПараметра = ВРег("ЗапятаяВНаименованииБанка") Тогда
		ОписаниеТипа = Новый ОписаниеТипов("Булево");
		ТекДанные.Значение = ОписаниеТипа.ПривестиЗначение(ТекДанные.Значение);
		ТекДанные.Описание = "Добавлять запятую перед указанием города в наименование банков";		
		
	ИначеЕсли ПроверяемоеИмяПараметра = ВРег("ИмяОбщегоМодуляОбработки")
		ИЛИ ПроверяемоеИмяПараметра = ВРег("ИмяСистемыИнициатора")
		ИЛИ ПроверяемоеИмяПараметра = ВРег("ИмяСистемыПолучателя")
		ИЛИ ПроверяемоеИмяПараметра = ВРег("КодСистемыИнициатора")	
		ИЛИ ПроверяемоеИмяПараметра = ВРег("КодСистемыПолучателя")	
		ИЛИ ПроверяемоеИмяПараметра = ВРег("ОтпечатокЗаголовка")	
		ИЛИ ПроверяемоеИмяПараметра = ВРег("ОтпечатокСущностей")
		ИЛИ ПроверяемоеИмяПараметра = ВРег("ИдОтправителя")
		ИЛИ ПроверяемоеИмяПараметра = ВРег("ТипСообщения")
		ИЛИ ПроверяемоеИмяПараметра = ВРег("КатегорияВзаимодействия")
		ИЛИ Лев(ПроверяемоеИмяПараметра,10) = ВРег("Заголовок.") Тогда
		
		ОписаниеТипа = Новый ОписаниеТипов("Строка");
		ТекДанные.Значение = ОписаниеТипа.ПривестиЗначение(ТекДанные.Значение);
		
	ИначеЕсли ПроверяемоеИмяПараметра = ВРег("ЗагружатьНовыеИзмененныеПлатежи") Тогда		
		
		ТекДанные.Значение = Истина;
		
	ИначеЕсли ПроверяемоеИмяПараметра = ВРег("СокращатьНаименованиеПлательщика") Тогда		
		
		ТекДанные.Значение = Истина;	
		
	ИначеЕсли ПроверяемоеИмяПараметра = ВРег("ПолучатьДанныеИзНастроекЛС") Тогда
		
		ОписаниеТипа = Новый ОписаниеТипов("Булево");
		ТекДанные.Значение = ОписаниеТипа.ПривестиЗначение(ТекДанные.Значение);
		ТекДанные.Описание = "Подключение возможности обмениваться файлами, которые содержат как в своем имени, так и в тексте, коды клиента, несоответствующие данным организации, указанной в Задании на импорт/экспорт" 
		
	ИначеЕсли ПроверяемоеИмяПараметра = ВРег("УчитыватьПереданныеПолномочия") Тогда
		
		ОписаниеТипа = Новый ОписаниеТипов("Булево");
		ТекДанные.Значение = ОписаниеТипа.ПривестиЗначение(ТекДанные.Значение);
		ТекДанные.Описание = "Указывать в файлах обмена организацию получателя полномочий при оформлении передачи полномочий";	
		
	ИначеЕсли ПроверяемоеИмяПараметра = ВРег("ОчередьСообщенийПоддерживается") Тогда
		
		ОписаниеТипа = Новый ОписаниеТипов("Булево");
		ТекДанные.Значение = ОписаниеТипа.ПривестиЗначение(ТекДанные.Значение);
		ТекДанные.Описание = "Признак, что сервис поддерживает или НЕ поддерживает очередь полученных сообщений.";
		
	КонецЕсли;
			
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекДанные = Элементы.Параметры.ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
    ПроверяемоеИмяПараметра = ВРег(ТекДанные.Имя);
	
	Если ПроверяемоеИмяПараметра = ВРег("ОтпечатокЗаголовка") 
		ИЛИ ПроверяемоеИмяПараметра = ВРег("ОтпечатокСущностей") Тогда
		
		СтандартнаяОбработка = Ложь;
					
		ОткрытьФорму("Справочник.СертификатыКлючейЭлектроннойПодписиИШифрования.ФормаВыбора",,ЭтотОбъект,,,, Новый ОписаниеОповещения("ПараметрыЗначениеНачалоВыбораЗавершение", ЭтотОбъект, Новый Структура("ТекДанные", ТекДанные)), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыЗначениеНачалоВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ТекДанные = ДополнительныеПараметры.ТекДанные;
	
	Если Результат<>Неопределено Тогда
		
		ТекДанные.Значение = ПолучитьОтпечатокСертификата(Результат);;
		
	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура ПараметрыПриАктивизацииЯчейки(Элемент)
	ТекДанные = Элементы.Параметры.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПроверяемоеИмяПараметра = ВРег(ТекДанные.Имя);
	
	Если ПроверяемоеИмяПараметра = ВРег("ИмяОбщегоМодуляОбработки") 
		ИЛИ ПроверяемоеИмяПараметра = ВРег("ТипСообщения")
		ИЛИ ПроверяемоеИмяПараметра = ВРег("КатегорияВзаимодействия")
		ИЛИ ПроверяемоеИмяПараметра = ВРег("ПрефиксКодаГосУслуги")
		ИЛИ ПроверяемоеИмяПараметра = ВРег("ЗагружатьНовыеИзмененныеПлатежи") 
		ИЛИ ПроверяемоеИмяПараметра = ВРег("ЗапятаяВНаименованииБанка")
		ИЛИ ПроверяемоеИмяПараметра = ВРег("УчитыватьПереданныеПолномочия")  
		ИЛИ ПроверяемоеИмяПараметра = ВРег("ПолучатьДанныеИзНастроекЛС")
		ИЛИ ПроверяемоеИмяПараметра = ВРег("ОчередьСообщенийПоддерживается") Тогда
		Элементы.ПараметрыЗначение.КнопкаСпискаВыбора = Истина;
		Элементы.ПараметрыЗначение.ВыбиратьТип = Ложь;
	Иначе
		Элементы.ПараметрыЗначение.КнопкаСпискаВыбора = Ложь;
		Элементы.ПараметрыЗначение.ВыбиратьТип = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьГИСГМП(Команда)
	
	Объект.СпособОбмена = ПредопределенноеЗначение("Перечисление.СпособыВыгрузкиФайловПередачи.WebСервис");
	ОбработатьСпособОбмена();
	
	Объект.Наименование = "Настройка для ГИС ГМП";
	Объект.Параметры.Очистить();
	
	//Добавление параметров 1
	НовСтр = Объект.Параметры.Добавить();
	НовСтр.Имя = "ИмяОбщегоМодуляОбработки";
	НовСтр.Значение = "Госуслуги";
	
	//Добавление параметров 2
	НовСтр = Объект.Параметры.Добавить();
	НовСтр.Имя = "ИмяСистемыИнициатора";
	НовСтр.Значение = "";
	НовСтр.Описание = "Имя ИС (с которым выполнена регистрация ИС в СМЭВ)";
	
	//Добавление параметров 3
	НовСтр = Объект.Параметры.Добавить();
	НовСтр.Имя = "КодСистемыИнициатора";
	НовСтр.Значение = "";
	НовСтр.Описание = "Мнемоника ИС (выдается при регистрации ИС в СМЭВ)(6 знаков)";
	
	//Добавление параметров 4
	НовСтр = Объект.Параметры.Добавить();
	НовСтр.Имя = "ИмяСистемыПолучателя";
	НовСтр.Значение = "Казначейство России";
	
	//Добавление параметров 5
	НовСтр = Объект.Параметры.Добавить();
	НовСтр.Имя = "КодСистемыПолучателя";
	НовСтр.Значение = "RKZN35001";
	
	//Добавление параметров 6
	НовСтр = Объект.Параметры.Добавить();
	НовСтр.Имя = "ИдОтправителя";
	НовСтр.Значение = "";
	НовСтр.Описание = "Код участника в ГИС ГМП (6 знаков)";
	
	//Добавление параметров 7
	НовСтр = Объект.Параметры.Добавить();
	НовСтр.Имя = "ТипСообщения";
	НовСтр.Значение = "GFNC";
	
	//Добавление параметров 8
	НовСтр = Объект.Параметры.Добавить();
	НовСтр.Имя = "КатегорияВзаимодействия";
	НовСтр.Значение = "6";
	
	//Добавление параметров 9
	НовСтр = Объект.Параметры.Добавить();
	НовСтр.Имя = "ОтпечатокЗаголовка";
	НовСтр.Значение = "";
	НовСтр.Описание = "Выберите квалифицированный сертификат (по 63-ФЗ) для подписи отправляемых сообщений";
	
	//Добавление параметров 10
	НовСтр = Объект.Параметры.Добавить();
	НовСтр.Имя = "ОтпечатокСущностей";
	НовСтр.Значение = "";
	НовСтр.Описание = "Выберите квалифицированный сертификат (по 63-ФЗ) для подписи отправляемых начислений";
	
	//Добавление параметров 11
	НовСтр = Объект.Параметры.Добавить();
	НовСтр.Имя = "ЗагружатьНовыеИзмененныеПлатежи";
	НовСтр.Значение = Истина;
	НовСтр.Описание = "Загружать только новые или измененные платежи";
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИСРНИП(Команда)
	
	Объект.СпособОбмена = ПредопределенноеЗначение("Перечисление.СпособыВыгрузкиФайловПередачи.WebСервис");;
	ОбработатьСпособОбмена();
	
	Объект.Наименование = "Настройка для ИС РНИП";
	Объект.Параметры.Очистить();
	
	//Добавление параметров 1
	НовСтр = Объект.Параметры.Добавить();
	НовСтр.Имя = "ИмяОбщегоМодуляОбработки";
	НовСтр.Значение = "Госуслуги";
	
	//Добавление параметров 2
	НовСтр = Объект.Параметры.Добавить();
	НовСтр.Имя = "ПрефиксКодаГосУслуги";
	НовСтр.Значение = "AAAAA";
		
	//Добавление параметров 3
	НовСтр = Объект.Параметры.Добавить();
	НовСтр.Имя = "КодСистемыИнициатора";
	НовСтр.Значение = "";
	НовСтр.Описание = "Код участника в ИС РНИП (5 знаков)";
			
	//Добавление параметров 4
	НовСтр = Объект.Параметры.Добавить();
	НовСтр.Имя = "ОтпечатокЗаголовка";
	НовСтр.Значение = "";
	НовСтр.Описание = "Выберите сертификат для подписи отправляемых сообщений";
	
	//Добавление параметров 5
	НовСтр = Объект.Параметры.Добавить();
	НовСтр.Имя = "ОтпечатокСущностей";
	НовСтр.Значение = "";
	НовСтр.Описание = "Выберите сертификат для подписи отправляемых начислений и каталога услуг";
	
	//Добавление параметров 6
	НовСтр = Объект.Параметры.Добавить();
	НовСтр.Имя = "ЗагружатьНовыеИзмененныеПлатежи";
	НовСтр.Значение = Истина;
	НовСтр.Описание = "Загружать только новые или измененные платежи";
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИСУНП(Команда)
	
	Объект.СпособОбмена = ПредопределенноеЗначение("Перечисление.СпособыВыгрузкиФайловПередачи.WebСервис");
	ОбработатьСпособОбмена();
	
	Объект.Наименование = "Настройка для ИС УНП";
	Объект.Параметры.Очистить();
	
	//Добавление параметров 1
	НовСтр = Объект.Параметры.Добавить();
	НовСтр.Имя = "ИмяОбщегоМодуляОбработки";
	НовСтр.Значение = "Госуслуги";
	
	//Добавление параметров 2
	НовСтр = Объект.Параметры.Добавить();
	НовСтр.Имя = "ПрефиксКодаГосУслуги";
	НовСтр.Значение = "AAAAA";
		
	//Добавление параметров 3
	НовСтр = Объект.Параметры.Добавить();
	НовСтр.Имя = "КодСистемыИнициатора";
	НовСтр.Значение = "";
	НовСтр.Описание = "Код участника в ГИС ГМП (6 знаков)";
			
	//Добавление параметров 4
	НовСтр = Объект.Параметры.Добавить();
	НовСтр.Имя = "ОтпечатокЗаголовка";
	НовСтр.Значение = "";
	НовСтр.Описание = "Выберите сертификат для подписи отправляемых сообщений";
	
	//Добавление параметров 5
	НовСтр = Объект.Параметры.Добавить();
	НовСтр.Имя = "ОтпечатокСущностей";
	НовСтр.Значение = "";
	НовСтр.Описание = "Выберите сертификат для подписи отправляемых начислений и каталога услуг";
	
	//Добавление параметров 6
	НовСтр = Объект.Параметры.Добавить();
	НовСтр.Имя = "ЗагружатьНовыеИзмененныеПлатежи";
	НовСтр.Значение = Истина;
	НовСтр.Описание = "Загружать только новые или измененные платежи";
	
	Объект.ИспользоватьBOM = Ложь;

КонецПроцедуры

&НаКлиенте
Процедура ПоказатьПароль(Команда)
	
	УправлениеМаскированиемПароля(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура СкрытьПароль(Команда)
	
	УправлениеМаскированиемПароля(Истина);
	
КонецПроцедуры

//Запрет редактирования реквизитов
&НаКлиенте
Процедура Подключаемый_РазрешитьРедактированиеРеквизитовОбъекта(Команда)

	ЗапретРедактированияРеквизитовОбъектовКлиент.РазрешитьРедактированиеРеквизитовОбъекта(ЭтаФорма);
	
КонецПроцедуры
//Конец Запрет редактирования реквизитов

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ИнтеграцияС1СДокументооборотом

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область СлужебныеПроцедурыИФункции


&НаКлиенте
Процедура ОбработатьВидОбмена()
	
	ПИ = ПолучитьПараметрыИнтеграции(Объект.Владелец);
	
	Элементы.ФормаЗаполнитьГИСГМП.Видимость = ПИ.ИнтеграцияГИСГМП;
	Элементы.ФормаЗаполнитьИСРНИП.Видимость = ПИ.ИнтеграцияИСРНИП;
	Элементы.ФормаЗаполнитьИСУНП.Видимость  = ПИ.ИнтеграцияИСРНИП;

	//Заполнение списка выбора параметров
	
	//Параметр для обмена с ОФК
	Элементы.ПараметрыИмя.СписокВыбора.Добавить("ОФК");	
	Элементы.ПараметрыИмя.СписокВыбора.Добавить("СокращатьНаименованиеПлательщика");
	Элементы.ПараметрыИмя.СписокВыбора.Добавить("ПолучатьДанныеИзНастроекЛС");
	Элементы.ПараметрыИмя.СписокВыбора.Добавить("ЗапятаяВНаименованииБанка");
	Элементы.ПараметрыИмя.СписокВыбора.Добавить("УчитыватьПереданныеПолномочия");
	
	Если ПИ.ИнтеграцияГИСГМП Или ПИ.ИнтеграцияИСРНИП Тогда
		//Параметры для обмена с ИС РНИП И ГИС ГМП		
		Элементы.ПараметрыИмя.СписокВыбора.Добавить("КодСистемыИнициатора");					
		Элементы.ПараметрыИмя.СписокВыбора.Добавить("ОтпечатокЗаголовка");	
		Элементы.ПараметрыИмя.СписокВыбора.Добавить("ОтпечатокСущностей");
		Элементы.ПараметрыИмя.СписокВыбора.Добавить("ЗагружатьНовыеИзмененныеПлатежи");
	КонецЕсли;
	
	Если ПИ.ИнтеграцияГИСГМП Тогда
		//Параметры для обмена с ГИС ГМП
		Элементы.ПараметрыИмя.СписокВыбора.Добавить("ИмяСистемыИнициатора");
		Элементы.ПараметрыИмя.СписокВыбора.Добавить("ИмяСистемыПолучателя");
		Элементы.ПараметрыИмя.СписокВыбора.Добавить("КодСистемыПолучателя");
		Элементы.ПараметрыИмя.СписокВыбора.Добавить("ИдОтправителя");
		Элементы.ПараметрыИмя.СписокВыбора.Добавить("ТипСообщения");
		Элементы.ПараметрыИмя.СписокВыбора.Добавить("КатегорияВзаимодействия");
		Элементы.ПараметрыИмя.СписокВыбора.Добавить("ОчередьСообщенийПоддерживается");
	КонецЕсли;
	
	Если ПИ.ИнтеграцияИСРНИП Тогда
		//Параметры для обмена с ИС РНИП
		Элементы.ПараметрыИмя.СписокВыбора.Добавить("ПрефиксКодаГосУслуги");
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПараметрыИнтеграции(ВидОбмена)
	
	ПредставлениеВНомереВерсии = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидОбмена, "ПредставлениеВНомереВерсии"); 	
	
	Если ПредставлениеВНомереВерсии = "RFI" Тогда
		ИнтеграцияИСРНИП = Ложь;
		ИнтеграцияГИСГМП = Ложь;
	Иначе		
		ИнтеграцияИСРНИП = ПолучитьФункциональнуюОпцию("ИспользоватьИнтеграциюСУНИФО");
		ИнтеграцияГИСГМП = ПолучитьФункциональнуюОпцию("ИспользоватьИнтеграциюГИСГМП");
	КонецЕсли;
	
	Возврат Новый Структура("ИнтеграцияИСРНИП,ИнтеграцияГИСГМП", ИнтеграцияИСРНИП, ИнтеграцияГИСГМП);
	
КонецФункции

&НаКлиенте
Процедура ОбработатьСпособОбмена(Инициализация = Ложь)

	Если Объект.СпособОбмена = ПредопределенноеЗначение("Перечисление.СпособыВыгрузкиФайловПередачи.Каталог") Тогда
		Элементы.СпособыЗагрузки.ТекущаяСтраница = Элементы.СтраницаЛокальная;
	Иначе
		Элементы.СпособыЗагрузки.ТекущаяСтраница = Элементы.СтраницаГлобальная;
		Если Объект.СпособОбмена = ПредопределенноеЗначение("Перечисление.СпособыВыгрузкиФайловПередачи.FTP") Тогда
			Элементы.СтраницыДопПараметры.ТекущаяСтраница = Элементы.СтраницаПараметрыFTP;
		Иначе
			Элементы.СтраницыДопПараметры.ТекущаяСтраница = Элементы.СтраницаПараметрыСервиса;
		КонецЕсли;		
		УстановитьПараметрыАдреса(Инициализация);			
	КонецЕсли;
	
	ЕстьПараметрЗаголовка = (Элементы.ПараметрыИмя.СписокВыбора.НайтиПоЗначению("Заголовок.ИмяЗаголовка") <> Неопределено);
	
	Если Объект.СпособОбмена = ПредопределенноеЗначение("Перечисление.СпособыВыгрузкиФайловПередачи.WebСервис") Тогда
		Если Не ЕстьПараметрЗаголовка Тогда
			Элементы.ПараметрыИмя.СписокВыбора.Добавить("Заголовок.ИмяЗаголовка");
		КонецЕсли;
	Иначе	
		Если ЕстьПараметрЗаголовка Тогда
			Элементы.ПараметрыИмя.СписокВыбора.Удалить(Элементы.ПараметрыИмя.СписокВыбора.НайтиПоЗначению("Заголовок.ИмяЗаголовка"));
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ОткрытьФормуВыбораКаталога(Поле)
	
	ДополнительныеПараметры = Новый Структура("Поле, Значение", Поле, Объект[Поле]);
	Оповещение              = Новый ОписаниеОповещения("ПослеВопросаОбУстановкеРасширенияРаботыСФайлами", ЭтотОбъект, ДополнительныеПараметры);
	ОбщегоНазначенияКлиент.ПоказатьВопросОбУстановкеРасширенияРаботыСФайлами(Оповещение,, Истина);
		
КонецПроцедуры

&НаКлиенте
Процедура ПослеВопросаОбУстановкеРасширенияРаботыСФайлами(РасширениеПодключено, ДополнительныеПараметры) Экспорт
	
	Если РасширениеПодключено Тогда
		СтандартнаяОбработка = Ложь;
		ДиалогВыбора         = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
		ДиалогВыбора.Каталог = ДополнительныеПараметры.Значение;
		ОписаниеОповещения   = Новый ОписаниеОповещения("ПослеВыбораКаталога", ЭтотОбъект, ДополнительныеПараметры);
	    ДиалогВыбора.Показать(ОписаниеОповещения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораКаталога(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеФайлы <> Неопределено Тогда		
		Объект[ДополнительныеПараметры.Поле] = ВыбранныеФайлы[0];		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОпределитьСпособОбменаПоАдресу()
	
	Позиция = Найти(Объект.ПутьВыгрузкиПоУмолчанию, "://");
	
	Если Позиция > 0 Тогда
		Схема = НРег(Лев(Объект.ПутьВыгрузкиПоУмолчанию, Позиция - 1));
		Если Сред(Схема, 1, 3) = "ftp" И Объект.СпособОбмена <> ПредопределенноеЗначение("Перечисление.СпособыВыгрузкиФайловПередачи.FTP") Тогда
			Объект.СпособОбмена = ПредопределенноеЗначение("Перечисление.СпособыВыгрузкиФайловПередачи.FTP");
			ОбработатьСпособОбмена();
		ИначеЕсли Сред(Схема, 1, 4) = "http" И Объект.СпособОбмена <> ПредопределенноеЗначение("Перечисление.СпособыВыгрузкиФайловПередачи.WebСервис") Тогда
			Объект.СпособОбмена = ПредопределенноеЗначение("Перечисление.СпособыВыгрузкиФайловПередачи.WebСервис");
			ОбработатьСпособОбмена();			
		КонецЕсли;		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПараметрыАдреса(Инициализация = Ложь)
	
	Попытка
		СтруктураАдреса = ОбщегоНазначенияКлиентСервер.СтруктураURI(Объект.ПутьВыгрузкиПоУмолчанию);
	Исключение
		СтруктураАдреса = Новый Структура("Схема,Хост,Порт,ПутьНаСервере,Логин,Пароль","","","","","","");
	КонецПопытки;
	
	Защищенное = Прав(СтруктураАдреса.Схема,1) = "s";
	
	УстановитьПараметрАдреса("Сервер",					СтруктураАдреса.Хост);
	УстановитьПараметрАдреса("Порт",					СтруктураАдреса.Порт, Неопределено);
	УстановитьПараметрАдреса("ПутьНаСервере",			СтруктураАдреса.ПутьНаСервере);
	УстановитьПараметрАдреса("Логин",					СтруктураАдреса.Логин);
	УстановитьПараметрАдреса("ЗащищенноеСоединение",	Защищенное, ?(ЗначениеЗаполнено(СтруктураАдреса.Схема), Не Защищенное, Ложь));

	Если Не Инициализация Тогда
		ЕстьПароль = (СтруктураАдреса.Пароль <> "");
		Если ЕстьПароль Тогда
			Пароль = СтруктураАдреса.Пароль;
			ПарольИзменен = Истина;
			Элементы.ГруппаПарольКнопки.Доступность = Истина;
		КонецЕсли;
	КонецЕсли;
	
	ПриИзмененииПорта();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииПорта()

	Если ЗначениеЗаполнено(Объект.Порт) Тогда
		ПортПоУмолчанию = "";
	Иначе
		Протокол = ?(Объект.СпособОбмена = ПредопределенноеЗначение("Перечисление.СпособыВыгрузкиФайловПередачи.FTP"), "ftp", "http") +
					?(Объект.ЗащищенноеСоединение, "s", "");
		ПортПоУмолчанию = ПортПротокола.Получить(Протокол);	
		ПортПоУмолчанию = ?(ПортПоУмолчанию = Неопределено, "", "(" + ПортПоУмолчанию + ")");		
	КонецЕсли;
	
	Элементы.Порт.Подсказка = ПортПоУмолчанию;
	
	// Для обновления выводимой подсказки перерисовываем элемент
	Элементы.Порт.Видимость = Ложь;
	Элементы.Порт.Видимость = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПараметрАдреса(ИмяРеквизита, Значение, ПустоеЗначение = "")
	
	Если Значение <> ПустоеЗначение И Объект[ИмяРеквизита] <> Значение Тогда
		Объект[ИмяРеквизита] = Значение;
		Модифицированность = Истина;
	КонецЕсли;
	
	Элементы[ИмяРеквизита].ТолькоПросмотр = (Значение <> ПустоеЗначение);			
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьОтпечатокСертификата(СертификатЭП)
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СертификатЭП, "Отпечаток");
	
КонецФункции

&НаКлиенте
Процедура УправлениеМаскированиемПароля(РежимПароля)
	
	Элементы.Пароль.РежимПароля = РежимПароля;
	Элементы.СкрытьПароль.Видимость = Не РежимПароля;
	Элементы.ПоказатьПароль.Видимость = РежимПароля;
	
КонецПроцедуры
	
#КонецОбласти


#Если Клиент Тогда	
	ПортПротокола = Новый Соответствие;
	ПортПротокола.Вставить("ftp",	21);
	ПортПротокола.Вставить("ftps",	990);
	ПортПротокола.Вставить("http",	80);
	ПортПротокола.Вставить("https",	443);
#КонецЕсли
